In [3]:
import pandas as pd

In [8]:
df = pd.read_csv('sample_data/sales_records.csv')
# first 5 rows
df.head(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.0,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.8,328376.44,248406.36

In [9]:
df.tail(3)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
97,Sub-Saharan Africa,Sierra Leone,Vegetables,Offline,C,6/1/2016,728815257,6/29/2016,1485,154.06,90.93,228779.10,135031.05,93748.05
98,North America,Mexico,Personal Care,Offline,M,7/30/2015,559427106,8/8/2015,5767,81.73,56.67,471336.91,326815.89,144521.02
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,2/10/2012,665095412,2/15/2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [10]:
df.describe()

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+02,100.000000,100.000000,100.000000,1.000000e+02,1.000000e+02,1.000000e+02
mean,5.550204e+08,5128.710000,276.761300,191.048000,1.373488e+06,9.318057e+05,4.416820e+05
std,2.606153e+08,2794.484562,235.592241,188.208181,1.460029e+06,1.083938e+06,4.385379e+05
min,1.146066e+08,124.000000,9.330000,6.920000,4.870260e+03,3.612240e+03,1.258020e+03
25%,3.389225e+08,2836.250000,81.730000,35.840000,2.687212e+05,1.688680e+05,1.214436e+05
50%,5.577086e+08,5382.500000,179.880000,107.275000,7.523144e+05,3.635664e+05,2.907680e+05
75%,7.907551e+08,7369.000000,437.200000,263.330000,2.212045e+06,1.613870e+06,6.358288e+05
max,9.940222e+08,9925.000000,668.270000,524.960000,5.997055e+06,4.509794e+06,1.719922e+06

In [12]:
df.dtypes

Region             object
Country            object
Item Type          object
Sales Channel      object
Order Priority     object
Order Date         object
Order ID            int64
Ship Date          object
Units Sold          int64
Unit Price        float64
Unit Cost         float64
Total Revenue     float64
Total Cost        float64
Total Profit      float64
dtype: object

In [13]:
# Handling Missing values
df.isnull()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [16]:
# I have to make a Nan data to learn how to handle empty or Nan data
df['Total Cost'][0] = None

C:\Users\asus\AppData\Local\Temp\ipykernel_11544\1815175979.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Total Cost'][0] = None

In [17]:
df['Total Cost'][0]

np.float64(nan)

In [26]:
# To check null value by column
df.isnull().any(axis=1)
# To check null value by row
# df.isnull().any(axis=0)

0      True
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [27]:
df.isnull().sum()

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        1
Total Profit      0
dtype: int64

In [32]:
# To fill the na/null data with some other value (not good apporoach)
df_filled = df.fillna(0) 
df_filled.head(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.0,0.00,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.8,328376.44,248406.36

In [36]:
# Filling missing value with the mean of the columne
df['Total_Cost_fillna'] = df['Total Cost'].fillna(df['Total Cost'].mean())
df.head(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit,Total_Cost_fillna
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.0,NaN,951410.50,925235.620303
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.8,328376.44,248406.36,328376.440000

In [ ]:
df.dtypes
# Object is basically a string

Region                object
Country               object
Item Type             object
Sales Channel         object
Order Priority        object
Order Date            object
Order ID               int64
Ship Date             object
Units Sold             int64
Unit Price           float64
Unit Cost            float64
Total Revenue        float64
Total Cost           float64
Total Profit         float64
Total_Cost_fillna    float64
dtype: object

In [39]:
# Renaming the column
df = df.rename(columns={'Ship Date':"Shipped Date"})
df.head(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Shipped Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit,Total_Cost_fillna
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.0,NaN,951410.50,925235.620303
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.8,328376.44,248406.36,328376.440000

In [43]:
# Change the data type
df["order_id_float"] = df["Order ID"].astype(float)
df.head(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Shipped Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit,Total_Cost_fillna,order_id_float
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.0,NaN,951410.50,925235.620303,669165933.0
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.8,328376.44,248406.36,328376.440000,963881480.0

In [44]:
# Apply a function to any column to perform any operations or changes
df['New_Unit_Cost']= df["Unit Cost"].apply(lambda x: x*2)
df.head(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Shipped Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit,Total_Cost_fillna,order_id_float,New_Unit_Cost
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.0,NaN,951410.50,925235.620303,669165933.0,318.84
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.8,328376.44,248406.36,328376.440000,963881480.0,234.22

In [ ]:
# Datat aggregating and grouping
grouped_mean = df.groupby('Region')['Total Profit'].mean()
print("grouped_mean of Total Profit based on Region \n", grouped_mean)

grouped_mean of Total Profit based on Region
 Region
Asia                                 555804.170000
Australia and Oceania                429287.275455
Central America and the Caribbean    406701.121429
Europe                               503769.937727
Middle East and North Africa         576119.186000
North America                        485980.920000
Sub-Saharan Africa                   338422.538889
Name: Total Profit, dtype: float64

In [47]:
# Grouping 2 different column with total profit
grouped_sum = df.groupby(['Region',"Country"])['Total Profit'].sum()
print(grouped_sum)

Region              Country
Asia                Bangladesh       606834.72
                    Brunei           846885.00
                    Kyrgyzstan         7828.12
                    Laos             235601.16
                    Malaysia          15103.47
                                       ...
Sub-Saharan Africa  Senegal          584073.87
                    Sierra Leone     649879.30
                    South Sudan       53252.50
                    The Gambia      1385883.27
                    Zambia           225246.90
Name: Total Profit, Length: 76, dtype: float64

In [49]:
# Using multiple aggregation function in a sigle time
grouped_data = df.groupby(['Region'])["Total Profit"].agg(['sum','mean','count'])
print(grouped_data)

                                           sum           mean  count
Region
Asia                                6113845.87  555804.170000     11
Australia and Oceania               4722160.03  429287.275455     11
Central America and the Caribbean   2846907.85  406701.121429      7
Europe                             11082938.63  503769.937727     22
Middle East and North Africa        5761191.86  576119.186000     10
North America                       1457942.76  485980.920000      3
Sub-Saharan Africa                 12183211.40  338422.538889     36

In [53]:
# Merging and joining data frames
df1 = pd.DataFrame({"key":["A","B","C"],"value1":[2,3,4]})
df2 = pd.DataFrame({"key":["A","B","D"],"value2":[7,8,9]})

In [54]:
df1

  key  value1
0   A       2
1   B       3
2   C       4

In [55]:
df2

  key  value2
0   A       7
1   B       8
2   D       9

In [56]:
# Merge the data frame on the "key" colume
pd.merge(df1,df2,on="key",how="inner")

  key  value1  value2
0   A       2       7
1   B       3       8

In [57]:
pd.merge(df1,df2,on="key",how="left")

  key  value1  value2
0   A       2     7.0
1   B       3     8.0
2   C       4     NaN

In [58]:
pd.merge(df1,df2,on="key",how="outer")

  key  value1  value2
0   A     2.0     7.0
1   B     3.0     8.0
2   C     4.0     NaN
3   D     NaN     9.0